app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-01-31 04:43:23.312682"], ["updated_at", "2019-01-31 04:43:23.312682"]]
---
  def create
    @student = Student.new(post_params(:title, :room_number))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-01-31 04:53:54.543757"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(post_params(:title, :room_number))